rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
/**@brief Function for handling Peer Manager events                   
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(false);
            break;

        default:
            break;
    }
}

static void sensor_communication_init(sensor_type_t type, uint8_t model, uint8_t address, nrf_drv_twi_t const * bus)
{
    switch (type)
    {
        case ACC_SENSOR:
            imu_comm.acc_comm.address = address;
            imu_comm.acc_comm.twi_bus = bus;
            imu_comm.acc_comm.read_register = sensor_read_register;
            imu_comm.acc_comm.write_register = sensor_write_register;
            if (model == LSM9DS1_ACC)
            {
                imu_comm.acc_comm.update_settings = lsm9ds1_acc_apply_setting;
                imu_comm.acc_comm.get_data = lsm9ds1_get_acc_data;
            }
            else if (model == FXOS8700_ACC)
            {
                imu_comm.acc_comm.update_settings = fxos8700_acc_apply_setting;
                imu_comm.acc_comm.get_data = fxos8700_get_acc_data;
            }
            break;
        case GYR_SENSOR:
            imu_comm.gyr_comm.address = address;
            imu_comm.gyr_comm.twi_bus = bus;
            imu_comm.gyr_comm.read_register = sensor_read_register;
            imu_comm.gyr_comm.write_register = sensor_write_register;
            if (model == LSM9DS1_GYR)
            {
                imu_comm.gyr_comm.update_settings = lsm9ds1_gyr_apply_setting;
                imu_comm.gyr_comm.get_data = lsm9ds1_get_gyr_data;
            }
            else if (model == FXAS21002_GYR)
            {
                imu_comm.gyr_comm.update_settings = NULL;
                imu_comm.gyr_comm.get_data = fxas21002_get_gyr_data;
            }
            break;
        case MAG_SENSOR:
            imu_comm.mag_comm.address = address;
            imu_comm.mag_comm.twi_bus = bus;
            imu_comm.mag_comm.read_register = sensor_read_register;
            imu_comm.mag_comm.write_register = sensor_write_register;
            if (model == LSM9DS1_MAG)
            {
                imu_comm.mag_comm.update_settings = lsm9ds1_mag_apply_setting;
                imu_comm.mag_comm.get_data = lsm9ds1_get_mag_data;
            }
            else if (model == FXOS8700_MAG)
            {
                imu_comm.mag_comm.update_settings = fxos8700_mag_apply_setting;
                imu_comm.mag_comm.get_data = fxos8700_get_mag_data;
            }
            break;
    }
}

static float sensor_odr_calculate()
{
    //Calculates the highest ODR of the three active sensors. The highest ODR
    //value will dictate the appropriate connection interval for the BLE connection.
    float current_highest_odr = 0.0;

    for (int i = 0; i < 3; i++)
    {
        if (imu_comm.sensor_model[i] == LSM9DS1_ACC)
        {
            float new_odr = lsm9ds1_odr_calculate(sensor_settings, imu_comm.sensor_model[0], imu_comm.sensor_model[1], imu_comm.sensor_model[2], i);
            if (new_odr > current_highest_odr) current_highest_odr = new_odr;
        }
        else if (imu_comm.sensor_model[i] == FXOS8700_ACC)
        {
            float new_odr;

            if (i == GYR_SENSOR) new_odr = fxas21002_odr_calculate(imu_comm.sensor_model[1], sensor_settings[GYR_START + ODR]);
            else new_odr = fxos8700_odr_calculate(imu_comm.sensor_model[0], imu_comm.sensor_model[2], sensor_settings[ACC_START + ODR], sensor_settings[MAG_START + ODR]);
            
            if (new_odr > current_highest_odr) current_highest_odr = new_odr;
        }
    }

    return current_highest_odr;
}

static void default_sensor_select()
{
    //Check that all sensors have been initialized after scanning the internal and external bus.
    //If not, then we're going to need to choose a non-default sensor. The first priority is to 
    //pick a sensor on the same chip (i.e. same model and TWI bus). If this can't work for 
    //whatever reason then try to select a sensor of the same model but on the other bus. If this
    //doesn't work, then select the first option available.
    if (!sensors_initialized[0] || !sensors_initialized[1] || !sensors_initialized[2])
    {
        for (int i = ACC_SENSOR; i <= MAG_SENSOR; i++)
        {
            if (sensors_initialized[i]) continue;

            //We'll need to put the new model number into the sensor settings array
            //so figure out the right place to do so.
            int setting_location;
            if (i == ACC_SENSOR) setting_location = ACC_START + SENSOR_MODEL;
            else if (i == GYR_SENSOR) setting_location = GYR_START + SENSOR_MODEL;
            else setting_location = MAG_START + SENSOR_MODEL;

            for (int j = 0; j < 3; j++)
            {
                if (!sensors_initialized[j]) continue;

                //Get the addresses for sensor i from sensor j's manufacturer
                uint8_t new_sensor_address_l = get_sensor_low_address(i, default_sensors[j]);
                uint8_t new_sensor_address_h = get_sensor_high_address(i, default_sensors[j]);

                //figure out which TWI bus sensor j is on
                nrf_drv_twi_t const * known_sensor_bus;
                if (j == 0) known_sensor_bus = imu_comm.acc_comm.twi_bus;
                else if (j == 1) known_sensor_bus = imu_comm.gyr_comm.twi_bus;
                else if (j == 2) known_sensor_bus = imu_comm.mag_comm.twi_bus;

                uint8_t* primary_search = internal_sensors, *secondary_search = external_sensors;
                int primary_stop = internal_sensors_found, secondary_stop = external_sensors_found;
                if (known_sensor_bus->inst_idx == 1)
                {
                    primary_search = external_sensors;
                    secondary_search = internal_sensors;
                    primary_stop = external_sensors_found;
                    secondary_stop = internal_sensors_found;
                }

                //NOTE: In the below loops, we can only initialize sensor i using sensor j's model number
                //because currently all sensor manufacturers I use have an acc, gyr and
                //mag so the model numbers line up (i.e. lsm9ds1_acc = 0, lsm9ds1_gyr = 0).
                //If I start using chips that don't have all three sensors then the 
                //model numbers will no longer line up and the below loops won't be safe anymore.

