rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
                //Search sensor j's TWI bus for sensor i.
                for (int k = 0; k < primary_stop; k++)
                {
                    if (primary_search[k] == new_sensor_address_l || primary_search[k] == new_sensor_address_h)
                    {
                        sensor_communication_init(i, default_sensors[j], primary_search[k], known_sensor_bus);
                        sensors_initialized[i] = true;
                        sensor_settings[setting_location] = default_sensors[j];
                        default_sensors[i] = default_sensors[j];
                        break; //if for whatever reason there are two of the same sensor on the line we only want to add the first one
                    }
                }

                if (sensors_initialized[i]) break; //move onto the next sensor

                //If we were external on sensor j's TWI bus, search the other TWI bus
                for (int k = 0; k < secondary_stop; k++)
                {
                    if (secondary_search[k] == new_sensor_address_l || secondary_search[k] == new_sensor_address_h)
                    {
                        sensor_communication_init(i, default_sensors[j], secondary_search[k], known_sensor_bus);
                        sensors_initialized[i] = true;
                        sensor_settings[setting_location] = default_sensors[j];
                        default_sensors[i] = default_sensors[j];
                        break; //if for whatever reason there are two of the same sensor on the line we only want to add the first one
                    }
                }

                if (sensors_initialized[i]) break; //move onto the next sensor
            }

            if (sensors_initialized[i]) continue; //if this sensor has been initialized then move on to the next one.

            //If we haven't initialized the sensor yet then it means we can't find one of
            //the appropriate model on either bus, so we need to just initialize the first
            //one possible.
            int stop;
            if (i == ACC_SENSOR) stop = ACC_MODEL_END;
            else if (i == GYR_SENSOR) stop = GYR_MODEL_END;
            else stop = MAG_MODEL_END;

            //search the external bus first
            for (int k = 0; k < external_sensors_found; k++)
            {
                //loopt through all models of the current sensor type
                for (int l = 0; l < stop; l++)
                {
                    uint8_t valid_sensor_address_l = get_sensor_low_address(i, l);
                    uint8_t valid_sensor_address_h = get_sensor_high_address(i, l);

                    if (external_sensors[k] == valid_sensor_address_l || external_sensors[k] == valid_sensor_address_h)
                    {
                        sensor_communication_init(i, l, external_sensors[k], get_external_twi_bus());
                        sensors_initialized[i] = true;
                        sensor_settings[setting_location] = l;
                        default_sensors[i] = l;
                        break; //if for whatever reason there are two of the same sensor on the line we only want to add the first one
                    }
                }
            }

            if (sensors_initialized[i]) continue; //move onto the next sensor

            //and finally search the internal bus
            for (int k = 0; k < internal_sensors_found; k++)
            {
                //loop through all models of the current sensor type
                for (int l = 0; l < stop; l++)
                {
                    uint8_t valid_sensor_address_l = get_sensor_low_address(i, l);
                    uint8_t valid_sensor_address_h = get_sensor_high_address(i, l);

                    if (internal_sensors[k] == valid_sensor_address_l || internal_sensors[k] == valid_sensor_address_h)
                    {
                        sensor_communication_init(i, l, internal_sensors[k], get_internal_twi_bus());
                        sensors_initialized[i] = true;
                        sensor_settings[setting_location] = l;
                        default_sensors[i] = l;
                        break; //if for whatever reason there are two of the same sensor on the line we only want to add the first one
                    }
                }
            }

            //If we haven't found a suitable sensor yet then there's something wrong. Print
            //an error statement
            if (!sensors_initialized[i]) SEGGER_RTT_WriteString(0, "Couldn't find any sensors, check board connections.\n");
        }
    }
}


/**@brief Function for the LSM9DS1 initialization.
 *
 * @details Initializes the LSM9DS1 accelerometer, gyroscope and magnetometer
 */
static void sensors_init(bool discovery)
{
    //When first turning on the Personal Caddie we need to scan both the internal
    //and external TWI bus to see what sensors are available so we can populate some
    //arrays with this information. Subsequent calls to this method don't require this.
    //Regardless of whether or not we enter this method in discovery mode, both TWI buses
    //need to be enabled.
    enable_twi_bus(get_internal_twi_bus_id());
    enable_twi_bus(get_external_twi_bus_id());
    nrf_delay_ms(50); //slight delay so sensors have time to power on
    
    if (discovery)
    {
        //First reset the sensor settings array, everything goes to zero except
        //the sensor models which are set to the default sensors.
        for (int i = 0; i < SENSOR_SETTINGS_LENGTH; i++) sensor_settings[i] = 0;
        sensor_settings[ACC_START + SENSOR_MODEL] = default_sensors[0];
        sensor_settings[GYR_START + SENSOR_MODEL] = default_sensors[1];
        sensor_settings[MAG_START + SENSOR_MODEL] = default_sensors[2];

        //Then initialize the internal and external sensors arrays so that each element
        //has a value of 0xFF. This value alerts the front end that no sensor is present.
        for (int i = 0; i < 10; i++)
        {
            internal_sensors[i] = 0xff;
            external_sensors[i] = 0xff;
        }

        //Initiate the TWI bus scan, looking for sensors
        twi_address_scan(internal_sensors, &internal_sensors_found, get_internal_twi_bus()); //Scan the internal TWI bus
        twi_address_scan(external_sensors, &external_sensors_found, get_external_twi_bus()); //Then scan the external bus

