rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
        //We also need to populate the available sensors characteristic with all the sensors
        //that were found on the internal and external TWI buses. This will allow the front
        //end application to dynamically choose which sensors to use.
        ble_gatts_value_t internal_available_sensors, external_available_sensors;

        internal_available_sensors.len = 10;
        internal_available_sensors.p_value = internal_sensors;
        internal_available_sensors.offset = 0;

        external_available_sensors.len = 10;
        external_available_sensors.p_value = external_sensors;
        external_available_sensors.offset = 10;

        uint32_t err_code = sd_ble_gatts_value_set(m_conn_handle, m_ss.available_handle.value_handle, &internal_available_sensors);
        APP_ERROR_CHECK(err_code);

        err_code = sd_ble_gatts_value_set(m_conn_handle, m_ss.available_handle.value_handle, &external_available_sensors);
        APP_ERROR_CHECK(err_code);
    }

    //Scan the external sensors to see if any of them match the default sensors that were
    //set in the settings array. If not, then scan the internal sensors to see if any of
    //them are there. If one of the default sensors isn't found on either bus then a
    //different one will need to be selected.
    if (external_sensors_found > 0)
    {
        for (int i = 0; i < 3; i++)
        {
            uint8_t default_sensor_address_l = get_sensor_low_address(i, default_sensors[i]);
            uint8_t default_sensor_address_h = get_sensor_high_address(i, default_sensors[i]);

            for (int j = 0; j < external_sensors_found; j++)
            {
                if (external_sensors[j] == default_sensor_address_l || external_sensors[j] == default_sensor_address_h)
                {
                    sensor_communication_init(i, default_sensors[i], external_sensors[j], get_external_twi_bus());
                    sensors_initialized[i] = true;
                    break; //if for whatever reason there are two of the same sensor on the line we only want to add the first one
                }
            }
        }
    }

    //See if all sensors were initialized on the external bus, if not, then initialized sensors
    //from internal bus
    if (!sensors_initialized[0] || !sensors_initialized[1] || !sensors_initialized[2])
    {
        for (int i = 0; i < 3; i++)
        {
            if (sensors_initialized[i]) continue; //this sensor was initialized on the external bus so skip it
            uint8_t default_sensor_address_l = get_sensor_low_address(i, default_sensors[i]);
            uint8_t default_sensor_address_h = get_sensor_high_address(i, default_sensors[i]);

            for (int j = 0; j < internal_sensors_found; j++)
            {
                if (internal_sensors[j] == default_sensor_address_l || internal_sensors[j] == default_sensor_address_h)
                {
                    sensor_communication_init(i, default_sensors[i], internal_sensors[j], get_internal_twi_bus());
                    sensors_initialized[i] = true;
                    break; //if for whatever reason there are two of the same sensor on the line we only want to add the first one
                }
            }
        }
    }

    //If any of the three sensors haven't been initialized yet, use the below
    //function to pick a different default sensor(s).
    default_sensor_select();

    //Handle the initialization of individual sensors. Currently the model for each sensor type
    //matches the enums for the other sensor models (i.e. lsm9ds1 acc/gyrmag all have enum values of 0x00).
    //We take advantage of this fact to see how many sensors from each model need to be initialized. This
    //may not hold up as more sensors get added, but I'll address that when the time comes.
    for (int i = 0; i < ACC_MODEL_END; i++)
    {
        int sensors = 0;
        for (int j = 0; j < 3; j++)
        {
            if (default_sensors[j] == i)
            {
                imu_comm.sensor_model[j] = i;
                sensors |= (1 << j);
            }
        }

        if (sensors != 0)
        {
            switch(i)
            {
                case LSM9DS1_ACC:
                    lsm9ds1_init(&imu_comm, sensors, sensor_settings);
                    break;
                case FXOS8700_ACC:
                    fxos8700init(&imu_comm, sensors, sensor_settings);
                    fxas21002init(&imu_comm, sensors, sensor_settings);
                    break;
            }
        }
    }

    //regardless of whether or not any sensors are found, disable the power pins and TWI bus
    disable_twi_bus(get_internal_twi_bus_id());
    disable_twi_bus(get_external_twi_bus_id());

    //After all sensors have been initialized, update the sensor settings characteristic to 
    //reflect the sensor settings array. Furthermore, we also set the connection interval 
    //to be equal to the highest sensor ODR (to the nearest 15th millisecond)
    ble_gatts_value_t settings;
    settings.len = SENSOR_SETTINGS_LENGTH;
    settings.p_value = sensor_settings;
    settings.offset = 0;
    uint32_t err_code = sd_ble_gatts_value_set(m_conn_handle, m_ss.settings_handles.value_handle, &settings);
    APP_ERROR_CHECK(err_code);
}

static void characteristic_update_and_notify()
{
    
    ble_gatts_hvx_params_t acc_notify_params, gyr_notify_params, mag_notify_params;
    memset(&acc_notify_params, 0, sizeof(acc_notify_params));
    memset(&gyr_notify_params, 0, sizeof(gyr_notify_params));
    memset(&mag_notify_params, 0, sizeof(mag_notify_params));

    uint16_t acc_data_characteristic_size = SENSOR_SAMPLES * SAMPLE_SIZE;
    uint16_t gyr_data_characteristic_size = SENSOR_SAMPLES * SAMPLE_SIZE;
    uint16_t mag_data_characteristic_size = SENSOR_SAMPLES * SAMPLE_SIZE;

    //Setup accelerometer notification first
    acc_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    acc_notify_params.handle = m_ss.data_handles[0].value_handle;
    acc_notify_params.p_data = acc_characteristic_data;
    acc_notify_params.p_len  = &acc_data_characteristic_size;
    acc_notify_params.offset = 0;

    //Setup gyroscope notification second
    gyr_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    gyr_notify_params.handle = m_ss.data_handles[1].value_handle;
    gyr_notify_params.p_data = gyr_characteristic_data;
    gyr_notify_params.p_len  = &gyr_data_characteristic_size;
    gyr_notify_params.offset = 0;

    //Setup magnetometer notification third
    mag_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    mag_notify_params.handle = m_ss.data_handles[2].value_handle;
    mag_notify_params.p_data = mag_characteristic_data;
    mag_notify_params.p_len  = &mag_data_characteristic_size;
    mag_notify_params.offset = 0;

    //Set the notifcation_done boolean to false and start notifications.
    //The boolean will be set to true in the BLE handler when the notification
    //is complete, alerting us to send out the next notification.


    m_notification_done = false;
    uint32_t ret = sd_ble_gatts_hvx(m_conn_handle, &acc_notify_params); //acc data notification
    ret = sd_ble_gatts_hvx(m_conn_handle, &gyr_notify_params); //gyr data notification
    ret = sd_ble_gatts_hvx(m_conn_handle, &mag_notify_params); //mag data notification

