rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    while (!m_notification_done) {} //wait for the three notifications to go out before continuing
    //APP_ERROR_CHECK(ret); //Uncommenting this can help debug notification errors
}

static void data_reading_timer_handler(void * p_context)
{
    //Everytime the data reading timer goes off we take sensor readings and then 
    //update the appropriate characteristic values. The timer should go off SENSOR_SAMPLES times
    //every connection interval
    imu_comm.acc_comm.get_data(acc_characteristic_data, SAMPLE_SIZE * measurements_taken);
    imu_comm.gyr_comm.get_data(gyr_characteristic_data, SAMPLE_SIZE * measurements_taken);
    imu_comm.mag_comm.get_data(mag_characteristic_data, SAMPLE_SIZE * measurements_taken);
    
    measurements_taken++;

    //after all the samples are read, update the characteristics and notify
    if ( measurements_taken == SENSOR_SAMPLES)
    {
        //SEGGER_RTT_WriteString(0, "Sending the following bytes to GYR characteristic:\n");
        //for (int i = 0; i < SENSOR_SAMPLES; i++)
        //{
        //    for (int j = 0; j < SAMPLE_SIZE; j++)
        //    {
        //        SEGGER_RTT_printf(0, "0x%#01x ", *(gyr_characteristic_data + i * SAMPLE_SIZE + j));
        //    }
        //    SEGGER_RTT_WriteString(0, "\n");
        //}
        //SEGGER_RTT_WriteString(0, "\n");

        m_data_ready = true; //flags the main loop to broadcast data notifications
        measurements_taken = 0; //reset the data counter
    }
}

static void led_timer_handler(void * p_context)
{
    //This timer causes the currently active LED to light up. A separate timer is used to 
    //turn the LED back off after a set time period
    if (USE_EXTERNAL_LEDS) nrf_gpio_pin_set(active_led);
    else nrf_gpio_pin_clear(active_led);

    nrf_drv_timer_clear(&LED_ON_TIMER); //reset the LED-on timer
    nrf_drv_timer_enable(&LED_ON_TIMER); //turn on the LED_on timer, the handler for this timer will turn the LED back off
    //uint32_t timer_val = nrf_drv_timer_capture(&LED_ON_TIMER, NRF_TIMER_CC_CHANNEL1);
}

void led_on_timer_handler(nrf_timer_event_t event_type, void* p_context)
{
    //This handler gets called when an LED is turned to the active state. Simply turn the 
    //LED back off when this handler is called and then turn the LED-on timer off.
    if (USE_EXTERNAL_LEDS) nrf_gpio_pin_clear(active_led);
    else nrf_gpio_pin_set(active_led);
    nrf_drv_timer_disable(&LED_ON_TIMER);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create a non-ble timer to help keep track of LED on time
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.frequency = NRF_TIMER_FREQ_16MHz;
    timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;

    err_code = nrf_drv_timer_init(&LED_ON_TIMER, &timer_cfg, led_on_timer_handler);
    APP_ERROR_CHECK(err_code);

    //TODO: Lower the led on timer when done testing
    uint32_t led_on_time = nrf_drv_timer_ms_to_ticks(&LED_ON_TIMER, 25); //the LEDs will only be on for 2 milliseconds while blinking
    nrf_drv_timer_extended_compare(&LED_ON_TIMER, NRF_TIMER_CC_CHANNEL0, led_on_time, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true); //calls the led_on_timer_handler

    // Create custom timers.
    app_timer_create(&m_data_reading_timer, APP_TIMER_MODE_REPEATED, data_reading_timer_handler);
    app_timer_create(&m_led_timer, APP_TIMER_MODE_REPEATED, led_timer_handler);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       APP_ERROR_CHECK(err_code); */

    //calculate the connection interval based on the ODR of the sensor
    //TODO: It would be better to move this into the sensor_init() method
    //      but for some reason I waas getting an error when putting it there.
    float sensor_odr = sensor_odr_calculate();

    int minimum_interval_required = 1000.0 / sensor_odr * SENSOR_SAMPLES + 1; //this is in milliseconds, hence the 1000
    minimum_interval_required += (15 - minimum_interval_required % 15); //round up to the nearest 15th millisecond

    //Convert from milliseconds to 1.25 millisecond units by dividing by 1.25 (same multiplying by 4/5)
    int mir_125 = minimum_interval_required / 5;
    mir_125 *= 4;

    //gap_conn_params.min_conn_interval = mir_125;
    //gap_conn_params.max_conn_interval = mir_125 + 12; //must be 15 ms (or 12 in 1.25ms units) greater at a minimum
    gap_conn_params.min_conn_interval = 0x30;
    gap_conn_params.max_conn_interval = 0x3c;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = SENSOR_CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

//Functions for updating sensor power modes and settings
static void sensor_idle_mode_start()
{ 
    //In this mode, the appropriate TWI bus(es) is active and power is going to the sensor(s) but the 
    //sensor is put into sleep mode. A red LED blinking in time with the connection 
    //interval shows when this mode is active.
    if (current_operating_mode == SENSOR_IDLE_MODE) return; //no need to change anything if already in idle mode

    //swap to the red LED
    if (USE_EXTERNAL_LEDS) active_led = EXTERNAL_RED_LED;
    else active_led = BLE_33_RED_LED;
    ret_code_t err_code;

    if (current_operating_mode == SENSOR_ACTIVE_MODE)
    {
        //If we're transitioning from active to idle mode we need to stop the data collection timer
        //and then put the sensor into sleep mode.
        err_code = app_timer_stop(m_data_reading_timer); //Even if the timer isn't actively on it's ok to call this method
        
        //Put all sensors into idle mode, any of the sensors that are active
        //will be properly initialized
        lsm9ds1_idle_mode_enable();
        fxos8700_idle_mode_enable();
        fxas21002_idle_mode_enable();

        //the LED is deactivated during data collection so turn it back on
        err_code = app_timer_start(m_led_timer, LED_DELAY, NULL); //Even if the timer is already on it's ok to call this method
    }
    else 
    {
        //If we aren't in sensor active or idle mode, it means that we arrived here from connection mode.
        //This means that both the TWI bus and sensors need to be turned on. There are two reasons why we'd
        //be turning on the sensors, either we're about to take data readings, or, we want to update the
        //sensor settings. In both cases we need to turn on the TWI bus to enable communication, but
        //before doing so we need to see if a call from the front end to use a different sensor has been made.

        uint8_t new_sensors = 0;

        SEGGER_RTT_printf(0, "Sensors in settings array: %d, %d, %d\n", sensor_settings[ACC_START + SENSOR_MODEL], sensor_settings[GYR_START + SENSOR_MODEL], sensor_settings[MAG_START + SENSOR_MODEL]);

        if (imu_comm.sensor_model[ACC_SENSOR] != sensor_settings[ACC_START + SENSOR_MODEL])
        {
            new_sensors |= 0b001;
            default_sensors[ACC_SENSOR] = sensor_settings[ACC_START + SENSOR_MODEL];
            sensors_initialized[ACC_SENSOR] = false;
        }

        if (imu_comm.sensor_model[GYR_SENSOR] != sensor_settings[GYR_START + SENSOR_MODEL])
        {
            new_sensors |= 0b010;
            default_sensors[GYR_SENSOR] = sensor_settings[GYR_START + SENSOR_MODEL];
            sensors_initialized[GYR_SENSOR] = false;
        }
        
