rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
        if (imu_comm.sensor_model[MAG_SENSOR] != sensor_settings[MAG_START + SENSOR_MODEL])
        {
            new_sensors |= 0b100;
            default_sensors[MAG_SENSOR] = sensor_settings[MAG_START + SENSOR_MODEL];
            sensors_initialized[MAG_SENSOR] = false;
        }

        //Initialize any new sensors that need it
        if (new_sensors) sensors_init(false);

        //turn on any TWI buses that are needed by the current sensors
        enable_twi_bus(imu_comm.acc_comm.twi_bus->inst_idx);
        enable_twi_bus(imu_comm.gyr_comm.twi_bus->inst_idx);
        enable_twi_bus(imu_comm.mag_comm.twi_bus->inst_idx);
        nrf_delay_ms(50); //slight delay so sensors have time to power on   
    }

    current_operating_mode = SENSOR_IDLE_MODE; //set the current operating mode to idle
}

static void sensor_active_mode_start()
{
    if (current_operating_mode != SENSOR_IDLE_MODE) return; //we can only go to active mode from idle mode

    //All of the settings for the sensor should have been set already, we just need to activate them
    //and then start the data collection timer. We also disable the LED to save on power
    app_timer_stop(m_led_timer); //disable the led by turning of it's timer

    //DEBUG: Turn on timer to see how offten measurements are being taken
    //nrf_drv_timer_clear(&LED_ON_TIMER); //reset the LED-on timer
    //nrf_drv_timer_enable(&LED_ON_TIMER); //turn on the LED_on timer, the handler for this timer will turn the LED back off
    
    //Put all sensors into idle mode, any of the sensors that are active
    //will be properly initialized
    lsm9ds1_active_mode_enable();
    fxos8700_active_mode_enable();
    fxas21002_active_mode_enable();

    //start data acquisition by turning on the data timer The timer needs to be converted from ms
    //to 'ticks' which match the frequency of the app timer. Normally this is done with a Macro but
    //that can't be accessed here so the macro code is copied here
    float sensor_odr = sensor_odr_calculate();
    int reading_timer_milliseconds = 1000.0 / sensor_odr + 1; //this is how often (in milliseconds) we need to take a sensor reading

    uint64_t A = reading_timer_milliseconds * (uint64_t)APP_TIMER_CLOCK_FREQ;
    uint64_t B = 1000 * (APP_TIMER_CONFIG_RTC_FREQUENCY + 1);
    uint32_t data_timer_delay = (((A) + ((B) / 2)) / (B));
    app_timer_start(m_data_reading_timer, data_timer_delay, NULL);
    
    current_operating_mode = SENSOR_ACTIVE_MODE; //set the current operating mode to idle
}

static void connected_mode_start()
{
    //We'll other be put into this mode from advertising mode (in which case all we need to do is 
    //change the color of the blinking LED, or from sensor_idle mode, in which case we need to 
    //disable the power going to the sensor and the TWI bus.
    if (current_operating_mode == SENSOR_IDLE_MODE)
    {
        //The chip is currently in sensor idle mode so we need to power off the sensors and disable any active TWI bus
        disable_twi_bus(imu_comm.acc_comm.twi_bus->inst_idx);
        disable_twi_bus(imu_comm.gyr_comm.twi_bus->inst_idx);
        disable_twi_bus(imu_comm.mag_comm.twi_bus->inst_idx);
    }

    //change the color of the blinking LED to green
    if (USE_EXTERNAL_LEDS) active_led = EXTERNAL_GREEN_LED;
    else active_led = BLE_33_GREEN_LED;
    current_operating_mode = CONNECTED_MODE; //set the current operating mode to idle
}

static void advertising_mode_start()
{
    //There are two ways to get into advertising mode, either by turning the device on,
    //or by losing a connection to a central device (whether this is intentional or 
    //accidental). In the latter case, we need to disable any sensors or peripherals
    //to save on power.

    switch (current_operating_mode)
    {
        case ADVERTISING_MODE:
            return; //no changes need to be made so leave the method
        case SENSOR_ACTIVE_MODE:
            sensor_idle_mode_start();
            //break statement purposely omitted here
        case SENSOR_IDLE_MODE:
            connected_mode_start();
            //break statement purposely omitted here
        default:
            if (USE_EXTERNAL_LEDS) active_led = EXTERNAL_BLUE_LED;
            else active_led = BLE_33_BLUE_LED;
            break;
    }

    current_operating_mode = ADVERTISING_MODE; //set the current operating mode to idle
    
    //finally, we need to terminate the existing connection
    //TODO: Implement this feature
}

void update_connection_interval()
{
    //When changing the settings for the IMU, we take a look to see if the ODR for the sensors
    //has changed. If so, we alter the current connection interval to get all data to the 
    //app in a timely manner.
    float sensor_odr = sensor_odr_calculate();
    if (sensor_odr != current_sensor_odr)
    {
        //if the odr has changed then we update the connection interval to match it
        int minimum_interval_required = 1000.0 / sensor_odr * SENSOR_SAMPLES + 1; //this is in milliseconds, hence the 1000
        minimum_interval_required += (15 - minimum_interval_required % 15); //round up to the nearest 15th millisecond

        //Convert from milliseconds to 1.25 millisecond units by dividing by 1.25 (same multiplying by 4/5)
        int mir_125 = minimum_interval_required / 5;
        mir_125 *= 4;

        //Now make the connection interval change request
        ret_code_t err_code = BLE_ERROR_INVALID_CONN_HANDLE;
        ble_gap_conn_params_t new_params;

        new_params.min_conn_interval = mir_125;
        new_params.max_conn_interval = mir_125 + 12; //must be 15 ms (or 12 in 1.25ms units) greater at a minimum to work with Apple Prodcuts
        new_params.slave_latency = SLAVE_LATENCY;
        new_params.conn_sup_timeout = SENSOR_CONN_SUP_TIMEOUT;

        //It's possible that the new parameters won't be applied as the Soft Device
        //is busy doing other stuff. In this case we need to wait until it's no longer
        //busy to apply the update.
        err_code = ble_conn_params_change_conn_params(m_conn_handle, &new_params);
        while (err_code == NRF_ERROR_BUSY)
        {
            err_code = ble_conn_params_change_conn_params(m_conn_handle, &new_params);
            SEGGER_RTT_WriteString(0, "SoftDevice Busy, retrying connection interval update.\n");
        }

        if (err_code != NRF_SUCCESS)
        {
            SEGGER_RTT_WriteString(0, "Couldn't update connection interval.\n");
        }
        else current_sensor_odr = sensor_odr;

        //We also need to update the preferred connection parameters, this will ensure that
        //we use the connection interval as specified in the sensor settings array in the case
        //that the connection is lost and re-established.
       
        //TODO: For some reason, the below call to ppcp_set() is working, however,
        //the desired connection interval isn't applied upon reconnection, the 
        //initial connection interval is. Why is this the case? To get around this,
        //just make a call to this update method inside the connection event
        err_code = sd_ble_gap_ppcp_set(&new_params);
        APP_ERROR_CHECK(err_code);
    }
}

