rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        APP_ERROR_CHECK(err_code);
    }
}

static void leds_init()
{
    //configure the pins for the BLE 33 Sense on-board red, green and blue tri-colored LED.

    if (USE_EXTERNAL_LEDS)
    {
        nrf_gpio_cfg_output(EXTERNAL_RED_LED);
        nrf_gpio_cfg_output(EXTERNAL_BLUE_LED);
        nrf_gpio_cfg_output(EXTERNAL_GREEN_LED);
    }
    else
    {
        nrf_gpio_cfg_output(BLE_33_RED_LED);
        nrf_gpio_cfg_output(BLE_33_BLUE_LED);
        nrf_gpio_cfg_output(BLE_33_GREEN_LED);

        //these LEDs are situated backwards from what you would expect so the pin needs to be 
        //pulled high for the LEDs to turn off
        nrf_gpio_pin_set(BLE_33_RED_LED);
        nrf_gpio_pin_set(BLE_33_BLUE_LED);
        nrf_gpio_pin_set(BLE_33_GREEN_LED);
    }
    
}

/**@brief Function for application main entry.
 */
int main(void)
 {
    bool erase_bonds;

    // Initialize.
    log_init();
    timers_init();
    power_management_init();
    ble_stack_init();
    gatt_init();
    services_init();
    twi_init();
    sensors_init(true);
    gap_params_init();
    advertising_init();
    conn_params_init();
    peer_manager_init();
    leds_init();

    // Start execution.
    application_timers_start();
    advertising_start(erase_bonds);

    // Enter main loop.
    for (;;)
    {
        idle_state_handle(); //puts CPU into sleep and waits for an event signal to wake it up

        //after the CPU get's woken up (at a minimum this should happen once every
        //connection interval), see if the data ready flag has been set to true and
        //if so, send out data notifications).
        if (m_data_ready)
        {
            characteristic_update_and_notify();
            m_data_ready = false;
            //SEGGER_RTT_printf(0, "Sending notification %d\n", ++adv_num);
        }
    }
}